Repository: D-OTIsud/Geotrek-admin
Catalog: docs/locales/*/LC_MESSAGES/translating.po
Languages: fr

source: TRANSLATING
fr: TRADUCTIONS

source: Getting started
fr: Commencer à traduire

source: Create an account
fr: Créer un compte

source: Browse by project
fr: Naviguer par projet

source: Browse by language
fr: Naviguer par langue

source: Click on "Register"
fr: Cliquer sur “S’inscrire”

source: Fill the register form
fr: Remplir le formulaire d’inscription

source: Validate your email
fr: Valider l’email

source: Fill the password
fr: Saisir le mot de passe

source: Then connect to weblate
fr: Se connecter

source: `Official documentation <https://docs.weblate.org/en/latest/user/profile.html>`__ to create an account and manage your profile.
fr: `Documentation officielle <https://docs.weblate.org/en/latest/user/profile.html>`__ pour la création de compte et la gestion du profil.

source: Go to “Project > Browse all projects”
fr: Aller dans “Projet > Parcourir tous les projets”

source: Click on tab “Languages”
fr: Aller dans l’onglet “Langues”

source: Choose the language to translate
fr: Choisir la langue à traduire

source: Go to “Languages > Browse all languages”
fr: Aller dans “Langues > Parcourir toutes les langues”

source: Choose the language you want to translate
fr: Choisir la langue que vous voulez traduire

source: Select the project to translate
fr: Sélectionner le projet à traduire

source: And let's go!
fr: Et c’est parti !

source: `Weblate official documentation <https://docs.weblate.org/en/latest/user/translating.html>`__ for translation.
fr: `Documentation officielle <https://docs.weblate.org/en/latest/user/translating.html>`__ de l’outil Weblate pour la traduction.

source: Translation features
fr: Fonctionnalités pour la traduction

source: Weblate shows all translation by language and by module. Errors and left to translate can be displayed easily.
fr: Weblate permet une vue d’ensemble des traductions par langue et par module. Il est possible d'afficher les erreurs de traduction ainsi que le reste à traduire.

source: Weblate can identify problematic translations as chains between projects, punctuation inconsistancy.
fr: Weblate permet de détecter automatiquement les incohérences, par exempleentre les autres modules projets, les ponctuations

source: Other occurrences in all components allows to check consistency.
fr: La liste des autres occurrences dans les autres composants permet de vérifier la cohérence.

source: Each translation generate a permalink (picto |image|).
fr: Chaque traduction génère un lien permanent (picto |image| à droite de “Traduction”).

source: Release translations (only for github repository managers)
fr: Publier les traductions (seulement pour les mainteneurs du dépôt Github)

source: Weblate send new translations to `translations` branch in Github, dedicated to translations. When new translations chains are validated, manager has to send the manually to Github.
fr: Weblate envoie les traductions nouvelles vers la branche `translations` dans Github, dédiée aux traductions. Lorsque des nouvelles traductions sont validées, le mainteneur doit les envoyer manuellement vers Github.

source: For each release, `translations` branch must be merged into master before building the release.
fr: À chaque nouvelle version, il faut fusionner la branche `translations` dans master avant de publier la version.

source: Send modifications to Github repository
fr: Envoyer les modifications vers le dépôt Github

source: In component, click "Manage > Repository maintenance"
fr: Dans le composant, cliquer sur "Gérer > Maintenance du dépôt"

source: Click "Commit" to save translation in local repository
fr: Cliquer sur "Enregistrer" pour enregistrer les traductions dans le dépôt local

source: Click "Push" to send local commits to `translations` branch in Github repository
fr: Cliquer sur "Pousser" pour envoyer les modifications locale vers la branche translation du dépôt sur github

source: Add translations to next release
fr: Ajouter les traductions à la prochaine version

source: In **Github**, merge `translations` branch into `master`, and update changelog.
fr: Dans **Github**, fusionner la branche `translations` dans la branche master, et mettre à jour le fichier changelog.

source: After releasing, in **Weblate**, rebase the branche :
fr: Après la release, dans **Weblate**, "refonder" (rebaser) la branche :

source: In the component, click "Manage > Repository maintenance"
fr: Dans le composant, cliquer sur "Gérer > Maintenance du dépôt"

source: Click "Rebase" to rebase `translations` branch onto `master`
fr: Cliquer sur "Refonder" pour effectuer un rebase de la branche `translations` sur `master`
